arduino/ArduinoCore-avr/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.cpu=Processor
menu.jtag=JTAG pins
menu.lto=Compiler LTO

##############################################################

yun.name=Arduino Yún
yun.upload.via_ssh=true

yun.vid.0=0x2341
yun.pid.0=0x0041
yun.vid.1=0x2341
yun.pid.1=0x8041
yun.vid.2=0x2A03
yun.pid.2=0x0041
yun.vid.3=0x2A03
yun.pid.3=0x8041
yun.upload_port.0.vid=0x2341
yun.upload_port.0.pid=0x0041
yun.upload_port.1.vid=0x2341
yun.upload_port.1.pid=0x8041
yun.upload_port.2.vid=0x2A03
yun.upload_port.2.pid=0x0041
yun.upload_port.3.vid=0x2A03
yun.upload_port.3.pid=0x8041
yun.upload_port.4.board=yun

yun.upload.tool=avrdude
yun.upload.tool.default=avrdude
yun.upload.tool.network=arduino_ota
yun.upload.protocol=avr109
yun.upload.maximum_size=28672
yun.upload.maximum_data_size=2560
yun.upload.speed=57600
yun.upload.disable_flushing=true
yun.upload.use_1200bps_touch=true
yun.upload.wait_for_upload_port=true

# JTAG pins
yun.menu.jtag.disabled=JTAG disabled
yun.menu.jtag.disabled.bootloader.high_fuses=0xd8
yun.menu.jtag.enabled=JTAG enabled
yun.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
yun.menu.lto.Os_flto=LTO enabled
yun.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
yun.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
yun.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
yun.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
yun.menu.lto.Os=LTO disabled
yun.menu.lto.Os.compiler.c.extra_flags=
yun.menu.lto.Os.compiler.c.elf.extra_flags=
yun.menu.lto.Os.compiler.cpp.extra_flags=
yun.menu.lto.Os.ltoarcmd=avr-ar

yun.bootloader.tool=avrdude
yun.bootloader.tool.default=avrdude
yun.bootloader.low_fuses=0xff
#yun.bootloader.high_fuses=0xd8
yun.bootloader.extended_fuses=0xfb
yun.bootloader.file=caterina/Caterina-Yun.hex
yun.bootloader.noblink=caterina/Caterina-Yun-noblink.hex
yun.bootloader.unlock_bits=0xFF
yun.bootloader.lock_bits=0xEF

yun.build.mcu=atmega32u4
yun.build.f_cpu=16000000L
yun.build.vid=0x2341
yun.build.pid=0x8041
yun.build.usb_product="Arduino Yun"
yun.build.board=AVR_YUN
yun.build.core=arduino
yun.build.variant=yun
yun.build.extra_flags={build.usb_flags}

##############################################################

uno.name=Arduino UNO

uno.vid.0=0x2341
uno.pid.0=0x0043
uno.vid.1=0x2341
uno.pid.1=0x0001
uno.vid.2=0x2A03
uno.pid.2=0x0043
uno.vid.3=0x2341
uno.pid.3=0x0243
uno.vid.4=0x2341
uno.pid.4=0x006A
uno.upload_port.0.vid=0x2341
uno.upload_port.0.pid=0x0043
uno.upload_port.1.vid=0x2341
uno.upload_port.1.pid=0x0001
uno.upload_port.2.vid=0x2A03
uno.upload_port.2.pid=0x0043
uno.upload_port.3.vid=0x2341
uno.upload_port.3.pid=0x0243
uno.upload_port.4.vid=0x2341
uno.upload_port.4.pid=0x006A
uno.upload_port.5.board=uno

uno.upload.tool=avrdude
uno.upload.tool.default=avrdude
uno.upload.tool.network=arduino_ota
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

# Compiler link time optimization
uno.menu.lto.Os_flto=LTO enabled
uno.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
uno.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
uno.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
uno.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
uno.menu.lto.Os=LTO disabled
uno.menu.lto.Os.compiler.c.extra_flags=
uno.menu.lto.Os.compiler.c.elf.extra_flags=
uno.menu.lto.Os.compiler.cpp.extra_flags=
uno.menu.lto.Os.ltoarcmd=avr-ar

uno.bootloader.tool=avrdude
uno.bootloader.tool.default=avrdude
uno.bootloader.low_fuses=0xFF
uno.bootloader.high_fuses=0xDE
uno.bootloader.extended_fuses=0xFD
uno.bootloader.unlock_bits=0xFF
uno.bootloader.lock_bits=0xCF
uno.bootloader.file=optiboot/optiboot_atmega328.hex

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=AVR_UNO
uno.build.core=arduino
uno.build.variant=standard

##############################################################

unomini.name=Arduino UNO Mini

unomini.vid.0=0x2341
unomini.pid.0=0x0062
unomini.upload_port.0.vid=0x2341
unomini.upload_port.0.pid=0x0062
unomini.upload_port.4.board=unomini

unomini.upload.tool=avrdude
unomini.upload.tool.default=avrdude
unomini.upload.tool.network=arduino_ota
unomini.upload.protocol=arduino
unomini.upload.maximum_size=32256
unomini.upload.maximum_data_size=2048
unomini.upload.speed=115200

# Compiler link time optimization
unomini.menu.lto.Os_flto=LTO enabled
unomini.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
unomini.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
unomini.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
unomini.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
unomini.menu.lto.Os=LTO disabled
unomini.menu.lto.Os.compiler.c.extra_flags=
unomini.menu.lto.Os.compiler.c.elf.extra_flags=
unomini.menu.lto.Os.compiler.cpp.extra_flags=
unomini.menu.lto.Os.ltoarcmd=avr-ar

unomini.bootloader.tool=avrdude
unomini.bootloader.tool.default=avrdude
unomini.bootloader.low_fuses=0xFF
unomini.bootloader.high_fuses=0xDE
unomini.bootloader.extended_fuses=0xFD
unomini.bootloader.unlock_bits=0xFF
unomini.bootloader.lock_bits=0xCF
unomini.bootloader.file=optiboot/optiboot_atmega328.hex

unomini.build.mcu=atmega328p
unomini.build.f_cpu=16000000L
unomini.build.board=AVR_UNO
unomini.build.core=arduino
unomini.build.variant=standard

##############################################################

diecimila.name=Arduino Duemilanove or Diecimila

diecimila.upload_port.0.board=diecimila

diecimila.upload.tool=avrdude
diecimila.upload.tool.default=avrdude
diecimila.upload.tool.network=arduino_ota
diecimila.upload.protocol=arduino

# Compiler link time optimization
diecimila.menu.lto.Os_flto=LTO enabled
diecimila.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
diecimila.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
diecimila.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
diecimila.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
diecimila.menu.lto.Os=LTO disabled
diecimila.menu.lto.Os.compiler.c.extra_flags=
diecimila.menu.lto.Os.compiler.c.elf.extra_flags=
diecimila.menu.lto.Os.compiler.cpp.extra_flags=
diecimila.menu.lto.Os.ltoarcmd=avr-ar


