arduino/ArduinoCore-avr/boards.txt
## Arduino Mega w/ ATmega1280
## -------------------------
mega.menu.cpu.atmega1280=ATmega1280

mega.menu.cpu.atmega1280.upload.protocol=arduino
mega.menu.cpu.atmega1280.upload.maximum_size=126976
mega.menu.cpu.atmega1280.upload.speed=57600

mega.menu.cpu.atmega1280.bootloader.high_fuses=0x{bootloader.high_fuses_part}A
mega.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
mega.menu.cpu.atmega1280.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex

mega.menu.cpu.atmega1280.build.mcu=atmega1280
mega.menu.cpu.atmega1280.build.board=AVR_MEGA

##############################################################

megaADK.name=Arduino Mega ADK

megaADK.vid.0=0x2341
megaADK.pid.0=0x003f
megaADK.vid.1=0x2341
megaADK.pid.1=0x0044
megaADK.vid.2=0x2A03
megaADK.pid.2=0x003f
megaADK.vid.3=0x2A03
megaADK.pid.3=0x0044
megaADK.upload_port.0.vid=0x2341
megaADK.upload_port.0.pid=0x003f
megaADK.upload_port.1.vid=0x2341
megaADK.upload_port.1.pid=0x0044
megaADK.upload_port.2.vid=0x2A03
megaADK.upload_port.2.pid=0x003f
megaADK.upload_port.3.vid=0x2A03
megaADK.upload_port.3.pid=0x0044
megaADK.upload_port.4.board=megaADK

megaADK.upload.tool=avrdude
megaADK.upload.tool.default=avrdude
megaADK.upload.tool.network=arduino_ota
megaADK.upload.protocol=wiring
megaADK.upload.maximum_size=253952
megaADK.upload.maximum_data_size=8192
megaADK.upload.speed=115200

# JTAG pins
megaADK.menu.jtag.disabled=JTAG disabled
megaADK.menu.jtag.disabled.bootloader.high_fuses=0xd8
megaADK.menu.jtag.enabled=JTAG enabled
megaADK.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
megaADK.menu.lto.Os_flto=LTO enabled
megaADK.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
megaADK.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
megaADK.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
megaADK.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
megaADK.menu.lto.Os=LTO disabled
megaADK.menu.lto.Os.compiler.c.extra_flags=
megaADK.menu.lto.Os.compiler.c.elf.extra_flags=
megaADK.menu.lto.Os.compiler.cpp.extra_flags=
megaADK.menu.lto.Os.ltoarcmd=avr-ar

megaADK.bootloader.tool=avrdude
megaADK.bootloader.tool.default=avrdude
megaADK.bootloader.low_fuses=0xFF
#megaADK.bootloader.high_fuses=0xD8
megaADK.bootloader.extended_fuses=0xFD
megaADK.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex
megaADK.bootloader.unlock_bits=0xFF
megaADK.bootloader.lock_bits=0xCF

megaADK.build.mcu=atmega2560
megaADK.build.f_cpu=16000000L
megaADK.build.board=AVR_ADK
megaADK.build.core=arduino
megaADK.build.variant=mega

##############################################################

leonardo.name=Arduino Leonardo
leonardo.vid.0=0x2341
leonardo.pid.0=0x0036
leonardo.vid.1=0x2341
leonardo.pid.1=0x8036
leonardo.vid.2=0x2A03
leonardo.pid.2=0x0036
leonardo.vid.3=0x2A03
leonardo.pid.3=0x8036
leonardo.upload_port.0.vid=0x2341
leonardo.upload_port.0.pid=0x0036
leonardo.upload_port.1.vid=0x2341
leonardo.upload_port.1.pid=0x8036
leonardo.upload_port.2.vid=0x2A03
leonardo.upload_port.2.pid=0x0036
leonardo.upload_port.3.vid=0x2A03
leonardo.upload_port.3.pid=0x8036
leonardo.upload_port.4.board=leonardo

leonardo.upload.tool=avrdude
leonardo.upload.tool.default=avrdude
leonardo.upload.tool.network=arduino_ota
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true


# JTAG pins
leonardo.menu.jtag.disabled=JTAG disabled
leonardo.menu.jtag.disabled.bootloader.high_fuses=0xd8
leonardo.menu.jtag.enabled=JTAG enabled
leonardo.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
leonardo.menu.lto.Os_flto=LTO enabled
leonardo.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
leonardo.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
leonardo.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
leonardo.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
leonardo.menu.lto.Os=LTO disabled
leonardo.menu.lto.Os.compiler.c.extra_flags=
leonardo.menu.lto.Os.compiler.c.elf.extra_flags=
leonardo.menu.lto.Os.compiler.cpp.extra_flags=
leonardo.menu.lto.Os.ltoarcmd=avr-ar


leonardo.bootloader.tool=avrdude
leonardo.bootloader.tool.default=avrdude
leonardo.bootloader.low_fuses=0xff
#leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb
leonardo.bootloader.file=caterina/Caterina-Leonardo.hex
leonardo.bootloader.unlock_bits=0xFF
leonardo.bootloader.lock_bits=0xEF

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=AVR_LEONARDO
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.extra_flags={build.usb_flags}

##############################################################

leonardoeth.name=Arduino Leonardo ETH
leonardoeth.vid.0=0x2a03
leonardoeth.pid.0=0x0040
leonardoeth.vid.1=0x2a03
leonardoeth.pid.1=0x8040
leonardoeth.upload_port.0.vid=0x2a03
leonardoeth.upload_port.0.pid=0x0040
leonardoeth.upload_port.1.vid=0x2a03
leonardoeth.upload_port.1.pid=0x8040
leonardoeth.upload_port.2.board=leonardoeth

leonardoeth.upload.tool=avrdude
leonardoeth.upload.tool.default=avrdude
leonardoeth.upload.tool.network=arduino_ota
leonardoeth.upload.protocol=avr109
leonardoeth.upload.maximum_size=28672
leonardoeth.upload.maximum_data_size=2560
leonardoeth.upload.speed=57600
leonardoeth.upload.disable_flushing=true
leonardoeth.upload.use_1200bps_touch=true
leonardoeth.upload.wait_for_upload_port=true

# JTAG pins
leonardoeth.menu.jtag.disabled=JTAG disabled
leonardoeth.menu.jtag.disabled.bootloader.high_fuses=0xd8
leonardoeth.menu.jtag.enabled=JTAG enabled
leonardoeth.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
leonardoeth.menu.lto.Os_flto=LTO enabled
leonardoeth.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
leonardoeth.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
leonardoeth.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
leonardoeth.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
leonardoeth.menu.lto.Os=LTO disabled
leonardoeth.menu.lto.Os.compiler.c.extra_flags=
leonardoeth.menu.lto.Os.compiler.c.elf.extra_flags=
leonardoeth.menu.lto.Os.compiler.cpp.extra_flags=
leonardoeth.menu.lto.Os.ltoarcmd=avr-ar

leonardoeth.bootloader.tool=avrdude
leonardoeth.bootloader.tool.default=avrdude
leonardoeth.bootloader.low_fuses=0xff
#leonardoeth.bootloader.high_fuses=0xd8
leonardoeth.bootloader.extended_fuses=0xcb
leonardoeth.bootloader.file=caterina/Caterina-LeonardoEthernet.hex
leonardoeth.bootloader.unlock_bits=0xFF
leonardoeth.bootloader.lock_bits=0xEF

leonardoeth.build.mcu=atmega32u4
leonardoeth.build.f_cpu=16000000L
leonardoeth.build.vid=0x2a03
leonardoeth.build.pid=0x8040
leonardoeth.build.usb_product="Arduino Leonardo ETH"
leonardoeth.build.board=AVR_LEONARDO_ETH
leonardoeth.build.core=arduino
leonardoeth.build.variant=leonardo
leonardoeth.build.extra_flags={build.usb_flags}

