arduino/ArduinoCore-avr/boards.txt
##############################################################

micro.name=Arduino Micro

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037
micro.vid.4=0x2341
micro.pid.4=0x0237
micro.vid.5=0x2341
micro.pid.5=0x8237
micro.upload_port.0.vid=0x2341
micro.upload_port.0.pid=0x0037
micro.upload_port.1.vid=0x2341
micro.upload_port.1.pid=0x8037
micro.upload_port.2.vid=0x2A03
micro.upload_port.2.pid=0x0037
micro.upload_port.3.vid=0x2A03
micro.upload_port.3.pid=0x8037
micro.upload_port.4.vid=0x2341
micro.upload_port.4.pid=0x0237
micro.upload_port.5.vid=0x2341
micro.upload_port.5.pid=0x8237
micro.upload_port.6.board=micro

micro.upload.tool=avrdude
micro.upload.tool.default=avrdude
micro.upload.tool.network=arduino_ota
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

# JTAG pins
micro.menu.jtag.disabled=JTAG disabled
micro.menu.jtag.disabled.bootloader.high_fuses=0xd8
micro.menu.jtag.enabled=JTAG enabled
micro.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
micro.menu.lto.Os_flto=LTO enabled
micro.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
micro.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
micro.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
micro.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
micro.menu.lto.Os=LTO disabled
micro.menu.lto.Os.compiler.c.extra_flags=
micro.menu.lto.Os.compiler.c.elf.extra_flags=
micro.menu.lto.Os.compiler.cpp.extra_flags=
micro.menu.lto.Os.ltoarcmd=avr-ar


micro.bootloader.tool=avrdude
micro.bootloader.tool.default=avrdude
micro.bootloader.low_fuses=0xff
#micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0xFF
micro.bootloader.lock_bits=0xEF

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

##############################################################

esplora.name=Arduino Esplora
esplora.vid.0=0x2341
esplora.pid.0=0x003C
esplora.vid.1=0x2341
esplora.pid.1=0x803C
esplora.vid.2=0x2A03
esplora.pid.2=0x003C
esplora.vid.3=0x2A03
esplora.pid.3=0x803C
esplora.upload_port.0.vid=0x2341
esplora.upload_port.0.pid=0x003C
esplora.upload_port.1.vid=0x2341
esplora.upload_port.1.pid=0x803C
esplora.upload_port.2.vid=0x2A03
esplora.upload_port.2.pid=0x003C
esplora.upload_port.3.vid=0x2A03
esplora.upload_port.3.pid=0x803C
esplora.upload_port.4.board=esplora

esplora.upload.tool=avrdude
esplora.upload.tool.default=avrdude
esplora.upload.tool.network=arduino_ota
esplora.upload.protocol=avr109
esplora.upload.maximum_size=28672
esplora.upload.maximum_data_size=2560
esplora.upload.speed=57600
esplora.upload.disable_flushing=true
esplora.upload.use_1200bps_touch=true
esplora.upload.wait_for_upload_port=true

# JTAG pins
esplora.menu.jtag.disabled=JTAG disabled
esplora.menu.jtag.disabled.bootloader.high_fuses=0xd8
esplora.menu.jtag.enabled=JTAG enabled
esplora.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
esplora.menu.lto.Os_flto=LTO enabled
esplora.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
esplora.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
esplora.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
esplora.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
esplora.menu.lto.Os=LTO disabled
esplora.menu.lto.Os.compiler.c.extra_flags=
esplora.menu.lto.Os.compiler.c.elf.extra_flags=
esplora.menu.lto.Os.compiler.cpp.extra_flags=
esplora.menu.lto.Os.ltoarcmd=avr-ar

esplora.bootloader.tool=avrdude
esplora.bootloader.tool.default=avrdude
esplora.bootloader.low_fuses=0xff
#esplora.bootloader.high_fuses=0xd8
esplora.bootloader.extended_fuses=0xcb
esplora.bootloader.file=caterina/Caterina-Esplora.hex
esplora.bootloader.unlock_bits=0xFF
esplora.bootloader.lock_bits=0xEF

esplora.build.mcu=atmega32u4
esplora.build.f_cpu=16000000L
esplora.build.vid=0x2341
esplora.build.pid=0x803c
esplora.build.usb_product="Arduino Esplora"
esplora.build.board=AVR_ESPLORA
esplora.build.core=arduino
esplora.build.variant=leonardo
esplora.build.extra_flags={build.usb_flags}

##############################################################

mini.name=Arduino Mini

mini.upload_port.0.board=mini

mini.upload.tool=avrdude
mini.upload.tool.default=avrdude
mini.upload.tool.network=arduino_ota
mini.upload.protocol=arduino

# Compiler link time optimization
mini.menu.lto.Os_flto=LTO enabled
mini.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
mini.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
mini.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
mini.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
mini.menu.lto.Os=LTO disabled
mini.menu.lto.Os.compiler.c.extra_flags=
mini.menu.lto.Os.compiler.c.elf.extra_flags=
mini.menu.lto.Os.compiler.cpp.extra_flags=
mini.menu.lto.Os.ltoarcmd=avr-ar

mini.bootloader.tool=avrdude
mini.bootloader.tool.default=avrdude
mini.bootloader.low_fuses=0xff
mini.bootloader.unlock_bits=0xFF
mini.bootloader.lock_bits=0xCF

mini.build.f_cpu=16000000L
mini.build.board=AVR_MINI
mini.build.core=arduino
mini.build.variant=eightanaloginputs

## Arduino Mini w/ ATmega328P
## --------------------------
mini.menu.cpu.atmega328=ATmega328P

mini.menu.cpu.atmega328.upload.maximum_size=28672
mini.menu.cpu.atmega328.upload.maximum_data_size=2048
mini.menu.cpu.atmega328.upload.speed=115200

mini.menu.cpu.atmega328.bootloader.high_fuses=0xd8
mini.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
mini.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

mini.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Mini w/ ATmega168
## -------------------------
mini.menu.cpu.atmega168=ATmega168

mini.menu.cpu.atmega168.upload.maximum_size=14336
mini.menu.cpu.atmega168.upload.maximum_data_size=1024
mini.menu.cpu.atmega168.upload.speed=19200

mini.menu.cpu.atmega168.bootloader.high_fuses=0xdd
mini.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
mini.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_ng.hex

