arduino/ArduinoCore-avr/boards.txt
mini.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

ethernet.name=Arduino Ethernet

ethernet.upload_port.0.board=ethernet

ethernet.upload.tool=avrdude
ethernet.upload.tool.default=avrdude
ethernet.upload.tool.network=arduino_ota
ethernet.upload.protocol=arduino
ethernet.upload.maximum_size=32256
ethernet.upload.maximum_data_size=2048
ethernet.upload.speed=115200

# Compiler link time optimization
ethernet.menu.lto.Os_flto=LTO enabled
ethernet.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
ethernet.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
ethernet.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
ethernet.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
ethernet.menu.lto.Os=LTO disabled
ethernet.menu.lto.Os.compiler.c.extra_flags=
ethernet.menu.lto.Os.compiler.c.elf.extra_flags=
ethernet.menu.lto.Os.compiler.cpp.extra_flags=
ethernet.menu.lto.Os.ltoarcmd=avr-ar

ethernet.bootloader.tool=avrdude
ethernet.bootloader.tool.default=avrdude
ethernet.bootloader.low_fuses=0xff
ethernet.bootloader.high_fuses=0xde
ethernet.bootloader.extended_fuses=0xFD
ethernet.bootloader.file=optiboot/optiboot_atmega328.hex
ethernet.bootloader.unlock_bits=0xFF
ethernet.bootloader.lock_bits=0xCF

ethernet.build.variant=ethernet
ethernet.build.mcu=atmega328p
ethernet.build.f_cpu=16000000L
ethernet.build.board=AVR_ETHERNET
ethernet.build.core=arduino

##############################################################

fio.name=Arduino Fio

fio.upload_port.0.board=fio

fio.upload.tool=avrdude
fio.upload.tool.default=avrdude
fio.upload.tool.network=arduino_ota
fio.upload.protocol=arduino
fio.upload.maximum_size=30720
fio.upload.maximum_data_size=2048
fio.upload.speed=57600

# Compiler link time optimization
fio.menu.lto.Os_flto=LTO enabled
fio.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
fio.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
fio.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
fio.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
fio.menu.lto.Os=LTO disabled
fio.menu.lto.Os.compiler.c.extra_flags=
fio.menu.lto.Os.compiler.c.elf.extra_flags=
fio.menu.lto.Os.compiler.cpp.extra_flags=
fio.menu.lto.Os.ltoarcmd=avr-ar

fio.bootloader.tool=avrdude
fio.bootloader.tool.default=avrdude
fio.bootloader.low_fuses=0xFF
fio.bootloader.high_fuses=0xDA
fio.bootloader.extended_fuses=0xFD
fio.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
fio.bootloader.unlock_bits=0xFF
fio.bootloader.lock_bits=0xCF

fio.build.mcu=atmega328p
fio.build.f_cpu=8000000L
fio.build.board=AVR_FIO
fio.build.core=arduino
fio.build.variant=eightanaloginputs

##############################################################

bt.name=Arduino BT

bt.upload_port.0.board=bt

bt.upload.tool=avrdude
bt.upload.tool.default=avrdude
bt.upload.tool.network=arduino_ota
bt.upload.protocol=arduino
bt.upload.speed=19200
bt.upload.disable_flushing=true

# Compiler link time optimization
bt.menu.lto.Os_flto=LTO enabled
bt.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
bt.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
bt.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
bt.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
bt.menu.lto.Os=LTO disabled
bt.menu.lto.Os.compiler.c.extra_flags=
bt.menu.lto.Os.compiler.c.elf.extra_flags=
bt.menu.lto.Os.compiler.cpp.extra_flags=
bt.menu.lto.Os.ltoarcmd=avr-ar

bt.bootloader.tool=avrdude
bt.bootloader.tool.default=avrdude
bt.bootloader.low_fuses=0xff
bt.bootloader.unlock_bits=0xFF
bt.bootloader.lock_bits=0xCF

bt.build.f_cpu=16000000L
bt.build.board=AVR_BT
bt.build.core=arduino
bt.build.variant=eightanaloginputs

## Arduino BT w/ ATmega328P
## ------------------------
bt.menu.cpu.atmega328=ATmega328P
bt.menu.cpu.atmega328.upload.maximum_size=28672
bt.menu.cpu.atmega328.upload.maximum_data_size=2048

bt.menu.cpu.atmega328.bootloader.high_fuses=0xd8
bt.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
bt.menu.cpu.atmega328.bootloader.file=bt/ATmegaBOOT_168_atmega328_bt.hex

bt.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino BT w/ ATmega168
## -----------------------
bt.menu.cpu.atmega168=ATmega168
bt.menu.cpu.atmega168.upload.maximum_size=14336
bt.menu.cpu.atmega168.upload.maximum_data_size=1024

bt.menu.cpu.atmega168.bootloader.high_fuses=0xdd
bt.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
bt.menu.cpu.atmega168.bootloader.file=bt/ATmegaBOOT_168.hex

bt.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

LilyPadUSB.name=LilyPad Arduino USB
LilyPadUSB.vid.0=0x1B4F
LilyPadUSB.pid.0=0x9207
LilyPadUSB.vid.1=0x1B4F
LilyPadUSB.pid.1=0x9208
LilyPadUSB.upload_port.0.vid=0x1B4F
LilyPadUSB.upload_port.0.pid=0x9207
LilyPadUSB.upload_port.1.vid=0x1B4F
LilyPadUSB.upload_port.1.pid=0x9208
LilyPadUSB.upload_port.2.board=LilyPadUSB

LilyPadUSB.upload.tool=avrdude
LilyPadUSB.upload.tool.default=avrdude
LilyPadUSB.upload.tool.network=arduino_ota
LilyPadUSB.upload.protocol=avr109
LilyPadUSB.upload.maximum_size=28672
LilyPadUSB.upload.maximum_data_size=2560
LilyPadUSB.upload.speed=57600
LilyPadUSB.upload.disable_flushing=true
LilyPadUSB.upload.use_1200bps_touch=true
LilyPadUSB.upload.wait_for_upload_port=true

# JTAG pins
LilyPadUSB.menu.jtag.disabled=JTAG disabled
LilyPadUSB.menu.jtag.disabled.bootloader.high_fuses=0xd8
LilyPadUSB.menu.jtag.enabled=JTAG enabled
LilyPadUSB.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
LilyPadUSB.menu.lto.Os_flto=LTO enabled
LilyPadUSB.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
LilyPadUSB.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
LilyPadUSB.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
LilyPadUSB.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
LilyPadUSB.menu.lto.Os=LTO disabled
LilyPadUSB.menu.lto.Os.compiler.c.extra_flags=
LilyPadUSB.menu.lto.Os.compiler.c.elf.extra_flags=
LilyPadUSB.menu.lto.Os.compiler.cpp.extra_flags=
LilyPadUSB.menu.lto.Os.ltoarcmd=avr-ar

LilyPadUSB.bootloader.tool=avrdude
LilyPadUSB.bootloader.tool.default=avrdude
LilyPadUSB.bootloader.low_fuses=0xff
#LilyPadUSB.bootloader.high_fuses=0xd8
LilyPadUSB.bootloader.extended_fuses=0xce
LilyPadUSB.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
LilyPadUSB.bootloader.unlock_bits=0xFF
LilyPadUSB.bootloader.lock_bits=0xEF

LilyPadUSB.build.mcu=atmega32u4
LilyPadUSB.build.f_cpu=8000000L
LilyPadUSB.build.vid=0x1B4F
LilyPadUSB.build.pid=0x9208
LilyPadUSB.build.usb_product="LilyPad USB"
LilyPadUSB.build.board=AVR_LILYPAD_USB
LilyPadUSB.build.core=arduino
LilyPadUSB.build.variant=leonardo
LilyPadUSB.build.extra_flags={build.usb_flags}

