arduino/ArduinoCore-avr/boards.txt
##############################################################

robotControl.name=Arduino Robot Control
robotControl.vid.0=0x2341
robotControl.pid.0=0x0038
robotControl.vid.1=0x2341
robotControl.pid.1=0x8038
robotControl.vid.2=0x2A03
robotControl.pid.2=0x0038
robotControl.vid.3=0x2A03
robotControl.pid.3=0x8038
robotControl.upload_port.0.vid=0x2341
robotControl.upload_port.0.pid=0x0038
robotControl.upload_port.1.vid=0x2341
robotControl.upload_port.1.pid=0x8038
robotControl.upload_port.2.vid=0x2A03
robotControl.upload_port.2.pid=0x0038
robotControl.upload_port.3.vid=0x2A03
robotControl.upload_port.3.pid=0x8038
robotControl.upload_port.4.board=robotControl

robotControl.upload.tool=avrdude
robotControl.upload.tool.default=avrdude
robotControl.upload.tool.network=arduino_ota
robotControl.upload.protocol=avr109
robotControl.upload.maximum_size=28672
robotControl.upload.maximum_data_size=2560
robotControl.upload.speed=57600
robotControl.upload.disable_flushing=true
robotControl.upload.use_1200bps_touch=true
robotControl.upload.wait_for_upload_port=true

# JTAG pins
robotControl.menu.jtag.disabled=JTAG disabled
robotControl.menu.jtag.disabled.bootloader.high_fuses=0xd8
robotControl.menu.jtag.enabled=JTAG enabled
robotControl.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
robotControl.menu.lto.Os_flto=LTO enabled
robotControl.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
robotControl.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
robotControl.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
robotControl.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
robotControl.menu.lto.Os=LTO disabled
robotControl.menu.lto.Os.compiler.c.extra_flags=
robotControl.menu.lto.Os.compiler.c.elf.extra_flags=
robotControl.menu.lto.Os.compiler.cpp.extra_flags=
robotControl.menu.lto.Os.ltoarcmd=avr-ar

robotControl.bootloader.tool=avrdude
robotControl.bootloader.tool.default=avrdude
robotControl.bootloader.low_fuses=0xff
#robotControl.bootloader.high_fuses=0xd8
robotControl.bootloader.extended_fuses=0xcb
robotControl.bootloader.file=caterina-Arduino_Robot/Caterina-Robot-Control.hex
robotControl.bootloader.unlock_bits=0xFF
robotControl.bootloader.lock_bits=0xEF

robotControl.build.mcu=atmega32u4
robotControl.build.f_cpu=16000000L
robotControl.build.vid=0x2341
robotControl.build.pid=0x8038
robotControl.build.usb_product="Robot Control"
robotControl.build.board=AVR_ROBOT_CONTROL
robotControl.build.core=arduino
robotControl.build.variant=robot_control
robotControl.build.extra_flags={build.usb_flags}

##############################################################

robotMotor.name=Arduino Robot Motor
robotMotor.vid.0=0x2341
robotMotor.pid.0=0x0039
robotMotor.vid.1=0x2341
robotMotor.pid.1=0x8039
robotMotor.vid.2=0x2A03
robotMotor.pid.2=0x0039
robotMotor.vid.3=0x2A03
robotMotor.pid.3=0x8039
robotMotor.upload_port.0.vid=0x2341
robotMotor.upload_port.0.pid=0x0039
robotMotor.upload_port.1.vid=0x2341
robotMotor.upload_port.1.pid=0x8039
robotMotor.upload_port.2.vid=0x2A03
robotMotor.upload_port.2.pid=0x0039
robotMotor.upload_port.3.vid=0x2A03
robotMotor.upload_port.3.pid=0x8039
robotMotor.upload_port.4.board=robotMotor

robotMotor.upload.tool=avrdude
robotMotor.upload.tool.default=avrdude
robotMotor.upload.tool.network=arduino_ota
robotMotor.upload.protocol=avr109
robotMotor.upload.maximum_size=28672
robotMotor.upload.maximum_data_size=2560
robotMotor.upload.speed=57600
robotMotor.upload.disable_flushing=true
robotMotor.upload.use_1200bps_touch=true
robotMotor.upload.wait_for_upload_port=true

# JTAG pins
robotMotor.menu.jtag.disabled=JTAG disabled
robotMotor.menu.jtag.disabled.bootloader.high_fuses=0xd8
robotMotor.menu.jtag.enabled=JTAG enabled
robotMotor.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
robotMotor.menu.lto.Os_flto=LTO enabled
robotMotor.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
robotMotor.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
robotMotor.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
robotMotor.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
robotMotor.menu.lto.Os=LTO disabled
robotMotor.menu.lto.Os.compiler.c.extra_flags=
robotMotor.menu.lto.Os.compiler.c.elf.extra_flags=
robotMotor.menu.lto.Os.compiler.cpp.extra_flags=
robotMotor.menu.lto.Os.ltoarcmd=avr-ar

robotMotor.bootloader.tool=avrdude
robotMotor.bootloader.tool.default=avrdude
robotMotor.bootloader.low_fuses=0xff
#robotMotor.bootloader.high_fuses=0xd8
robotMotor.bootloader.extended_fuses=0xcb
robotMotor.bootloader.file=caterina-Arduino_Robot/Caterina-Robot-Motor.hex
robotMotor.bootloader.unlock_bits=0xFF
robotMotor.bootloader.lock_bits=0xEF

robotMotor.build.mcu=atmega32u4
robotMotor.build.f_cpu=16000000L
robotMotor.build.vid=0x2341
robotMotor.build.pid=0x8039
robotMotor.build.usb_product="Robot Motor"
robotMotor.build.board=AVR_ROBOT_MOTOR
robotMotor.build.core=arduino
robotMotor.build.variant=robot_motor
robotMotor.build.extra_flags={build.usb_flags}

##############################################################

gemma.vid.0=0x2341
gemma.pid.0=0x0c9f
gemma.upload_port.0.vid=0x2341
gemma.upload_port.0.pid=0x0c9f
gemma.upload_port.1.board=gemma

gemma.name=Arduino Gemma

gemma.bootloader.low_fuses=0xF1
gemma.bootloader.high_fuses=0xD5
gemma.bootloader.extended_fuses=0xFE
gemma.bootloader.tool=avrdude
gemma.bootloader.tool.default=avrdude
gemma.bootloader.lock_bits=
gemma.bootloader.unlock_bits=
gemma.bootloader.file=gemma/gemma_v1.hex

# Compiler link time optimization
gemma.menu.lto.Os_flto=LTO enabled
gemma.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
gemma.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
gemma.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
gemma.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
gemma.menu.lto.Os=LTO disabled
gemma.menu.lto.Os.compiler.c.extra_flags=
gemma.menu.lto.Os.compiler.c.elf.extra_flags=
gemma.menu.lto.Os.compiler.cpp.extra_flags=
gemma.menu.lto.Os.ltoarcmd=avr-ar

gemma.build.mcu=attiny85
gemma.build.f_cpu=8000000L
gemma.build.core=arduino
gemma.build.variant=gemma
gemma.build.board=AVR_GEMMA

