arduino/ArduinoCore-avr/boards.txt
gemma.upload.tool=avrdude
gemma.upload.tool.default=avrdude
gemma.upload.tool.network=arduino_ota
gemma.upload.maximum_size=5310

##############################################################

# Adafruit Circuit Playground 32u4 w/Caterina Configuration
circuitplay32u4cat.name=Adafruit Circuit Playground
circuitplay32u4cat.bootloader.low_fuses=0xff
#circuitplay32u4cat.bootloader.high_fuses=0xd8
circuitplay32u4cat.bootloader.extended_fuses=0xcb
circuitplay32u4cat.bootloader.file=caterina/Caterina-Circuitplay32u4.hex
circuitplay32u4cat.bootloader.unlock_bits=0xFF
circuitplay32u4cat.bootloader.lock_bits=0xEF
circuitplay32u4cat.bootloader.tool=avrdude
circuitplay32u4cat.bootloader.tool.default=avrdude
circuitplay32u4cat.build.mcu=atmega32u4
circuitplay32u4cat.build.f_cpu=8000000L
circuitplay32u4cat.build.vid=0x239A
circuitplay32u4cat.build.pid=0x8011
circuitplay32u4cat.build.core=arduino
circuitplay32u4cat.build.variant=circuitplay32u4
circuitplay32u4cat.build.board=AVR_CIRCUITPLAY
circuitplay32u4cat.build.usb_product="Circuit Playground"
circuitplay32u4cat.build.usb_manufacturer="Adafruit"
circuitplay32u4cat.build.extra_flags={build.usb_flags}
circuitplay32u4cat.upload.protocol=avr109
circuitplay32u4cat.upload.maximum_size=28672
circuitplay32u4cat.upload.speed=57600
circuitplay32u4cat.upload.disable_flushing=true
circuitplay32u4cat.upload.use_1200bps_touch=true
circuitplay32u4cat.upload.wait_for_upload_port=true
circuitplay32u4cat.upload.tool=avrdude
circuitplay32u4cat.upload.tool.default=avrdude
circuitplay32u4cat.upload.tool.network=arduino_ota
circuitplay32u4cat.vid.0=0x239A
circuitplay32u4cat.pid.0=0x8011
circuitplay32u4cat.upload_port.0.vid=0x239A
circuitplay32u4cat.upload_port.0.pid=0x8011
circuitplay32u4cat.upload_port.1.board=circuitplay32u4cat

# JTAG pins
circuitplay32u4cat.menu.jtag.disabled=JTAG disabled
circuitplay32u4cat.menu.jtag.disabled.bootloader.high_fuses=0xd8
circuitplay32u4cat.menu.jtag.enabled=JTAG enabled
circuitplay32u4cat.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
circuitplay32u4cat.menu.lto.Os_flto=LTO enabled
circuitplay32u4cat.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
circuitplay32u4cat.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
circuitplay32u4cat.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
circuitplay32u4cat.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
circuitplay32u4cat.menu.lto.Os=LTO disabled
circuitplay32u4cat.menu.lto.Os.compiler.c.extra_flags=
circuitplay32u4cat.menu.lto.Os.compiler.c.elf.extra_flags=
circuitplay32u4cat.menu.lto.Os.compiler.cpp.extra_flags=
circuitplay32u4cat.menu.lto.Os.ltoarcmd=avr-ar

##############################################################

yunmini.name=Arduino Yún Mini
yunmini.upload.via_ssh=true

yunmini.vid.0=0x2a03
yunmini.pid.0=0x0050
yunmini.vid.1=0x2a03
yunmini.pid.1=0x8050
yunmini.upload_port.0.vid=0x2a03
yunmini.upload_port.0.pid=0x0050
yunmini.upload_port.1.vid=0x2a03
yunmini.upload_port.1.pid=0x8050
yunmini.upload_port.2.board=yunmini

yunmini.upload.tool=avrdude
yunmini.upload.tool.default=avrdude
yunmini.upload.tool.network=arduino_ota
yunmini.upload.protocol=avr109
yunmini.upload.maximum_size=28672
yunmini.upload.maximum_data_size=2560
yunmini.upload.speed=57600
yunmini.upload.disable_flushing=true
yunmini.upload.use_1200bps_touch=true
yunmini.upload.wait_for_upload_port=true

# JTAG pins
yunmini.menu.jtag.disabled=JTAG disabled
yunmini.menu.jtag.disabled.bootloader.high_fuses=0xd8
yunmini.menu.jtag.enabled=JTAG enabled
yunmini.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
yunmini.menu.lto.Os_flto=LTO enabled
yunmini.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
yunmini.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
yunmini.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
yunmini.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
yunmini.menu.lto.Os=LTO disabled
yunmini.menu.lto.Os.compiler.c.extra_flags=
yunmini.menu.lto.Os.compiler.c.elf.extra_flags=
yunmini.menu.lto.Os.compiler.cpp.extra_flags=
yunmini.menu.lto.Os.ltoarcmd=avr-ar

yunmini.bootloader.tool=avrdude
yunmini.bootloader.tool.default=avrdude
yunmini.bootloader.low_fuses=0xff
#yunmini.bootloader.high_fuses=0xd8
yunmini.bootloader.extended_fuses=0xfb
yunmini.bootloader.file=caterina/Caterina-YunMini.hex
yunmini.bootloader.unlock_bits=0xFF
yunmini.bootloader.lock_bits=0xEF

yunmini.build.mcu=atmega32u4
yunmini.build.f_cpu=16000000L
yunmini.build.vid=0x2a03
yunmini.build.pid=0x8050
yunmini.build.usb_product="Arduino Yún Mini"
yunmini.build.board=AVR_YUNMINI
yunmini.build.core=arduino
yunmini.build.variant=yun
yunmini.build.extra_flags={build.usb_flags}

##############################################################

chiwawa.name=Arduino Industrial 101
chiwawa.upload.via_ssh=true

chiwawa.vid.0=0x2a03
chiwawa.pid.0=0x0056
chiwawa.vid.1=0x2a03
chiwawa.pid.1=0x8056
chiwawa.upload_port.0.vid=0x2a03
chiwawa.upload_port.0.pid=0x0056
chiwawa.upload_port.1.vid=0x2a03
chiwawa.upload_port.1.pid=0x8056
chiwawa.upload_port.2.board=chiwawa

chiwawa.upload.tool=avrdude
chiwawa.upload.tool.default=avrdude
chiwawa.upload.tool.network=arduino_ota
chiwawa.upload.protocol=avr109
chiwawa.upload.maximum_size=28672
chiwawa.upload.maximum_data_size=2560
chiwawa.upload.speed=57600
chiwawa.upload.disable_flushing=true
chiwawa.upload.use_1200bps_touch=true
chiwawa.upload.wait_for_upload_port=true

# JTAG pins
chiwawa.menu.jtag.disabled=JTAG disabled
chiwawa.menu.jtag.disabled.bootloader.high_fuses=0xd8
chiwawa.menu.jtag.enabled=JTAG enabled
chiwawa.menu.jtag.enabled.bootloader.high_fuses=0x98

# Compiler link time optimization
chiwawa.menu.lto.Os_flto=LTO enabled
chiwawa.menu.lto.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
chiwawa.menu.lto.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
chiwawa.menu.lto.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
chiwawa.menu.lto.Os_flto.ltoarcmd=avr-gcc-ar
chiwawa.menu.lto.Os=LTO disabled
chiwawa.menu.lto.Os.compiler.c.extra_flags=
chiwawa.menu.lto.Os.compiler.c.elf.extra_flags=
chiwawa.menu.lto.Os.compiler.cpp.extra_flags=
chiwawa.menu.lto.Os.ltoarcmd=avr-ar

chiwawa.bootloader.tool=avrdude
chiwawa.bootloader.tool.default=avrdude
chiwawa.bootloader.low_fuses=0xff
#chiwawa.bootloader.high_fuses=0xd8
chiwawa.bootloader.extended_fuses=0xfb
chiwawa.bootloader.file=caterina/Caterina-Industrial101.hex
chiwawa.bootloader.unlock_bits=0xFF
chiwawa.bootloader.lock_bits=0xEF

chiwawa.build.mcu=atmega32u4
chiwawa.build.f_cpu=16000000L
chiwawa.build.vid=0x2a03
chiwawa.build.pid=0x8056
chiwawa.build.usb_product="Arduino Industrial 101"
chiwawa.build.board=AVR_INDUSTRIAL101
chiwawa.build.core=arduino
chiwawa.build.variant=yun
chiwawa.build.extra_flags={build.usb_flags}

